In [ ]:
import sqlalchemy as db
import pandas as pd


from getpass import getpass
password=getpass("My sql password: ")
dbName="publications"
connectionData=f"mysql+pymysql://root:{password}@localhost/{dbName}"
engine = db.create_engine(connectionData)
print("Connected to server!")

In [ ]:
'''In this challenge you will write a MySQL SELECT query that joins various tables to figure
out what titles each author has published at which publishers. 
Your output should have at least the following columns:

AUTHOR ID - the ID of the author
LAST NAME - author last name
FIRST NAME - author first name
TITLE - name of the published title
PUBLISHER - name of the publisher where the title was published'''


df = pd.read_sql_query("""
SELECT au.au_id AS AUTHOR_ID, au.au_lname AS LAST_NAME, au.au_fname AS FIRST_NAME, t.title AS TITLE , p.pub_name AS PUBLISHER
	FROM authors as au
	INNER JOIN titleauthor AS tta
		ON tta.au_id = au.au_id
	INNER JOIN titles AS t
		ON tta.title_id = t.title_id
	INNER JOIN publishers as p
		on t.pub_id=p.pub_id

""", engine)
display(df)

In [ ]:
df1 = pd.read_sql_query("""
SELECT au.au_id AS AUTHOR_ID, au.au_lname AS LAST_NAME, au.au_fname AS FIRST_NAME , p.pub_name AS PUBLISHER, count(*) TITLE_COUNT
	FROM authors as au
	INNER JOIN titleauthor AS tta
		ON tta.au_id = au.au_id
	INNER JOIN titles AS t
		ON tta.title_id = t.title_id
	INNER JOIN publishers as p
		on t.pub_id=p.pub_id
	GROUP BY au.au_id, p.pub_name;
""", engine)
display(df1)

In [ ]:
df2 = pd.read_sql_query("""
SELECT au.au_id AS AUTHOR_ID, au.au_lname AS LAST_NAME, au.au_fname AS FIRST_NAME , SUM(s.qty) TOTAL 
	FROM authors as au
	INNER JOIN titleauthor AS tta
		ON tta.au_id = au.au_id
	INNER JOIN titles AS t
		ON tta.title_id = t.title_id
	INNER JOIN sales as s
		on t.title_id=s.title_id
	GROUP BY au.au_id, t.title
    ORDER BY TOTAL DESC
    LIMIT 3;
""", engine)
display(df2)

In [ ]:
df3 = pd.read_sql_query("""
SELECT au.au_id AS AUTHOR_ID, au.au_lname AS LAST_NAME, au.au_fname AS FIRST_NAME , IFNULL(SUM(s.qty),0) TOTAL 
	FROM authors as au
	  JOIN titleauthor AS tta
		ON tta.au_id = au.au_id
	  JOIN titles AS t
		ON tta.title_id = t.title_id
	  LEFT JOIN sales as s
		on t.title_id=s.title_id
	GROUP BY au.au_id, t.title
    ORDER BY TOTAL DESC;
""", engine)
display(df3)

In [ ]:
df4 = pd.read_sql_query("""
SELECT au.au_id AS AUTHOR_ID, au.au_lname AS LAST_NAME, au.au_fname AS FIRST_NAME, ROUND(SUM(tta.royaltyper*(t.price+t.advance)),0) PROFIT 
	FROM authors as au
	  JOIN titleauthor AS tta
		ON tta.au_id = au.au_id
	  JOIN titles AS t
		ON tta.title_id = t.title_id
	  LEFT JOIN sales as s
		on t.title_id=s.title_id
	GROUP BY au.au_id
    ORDER BY PROFIT DESC
    LIMIT 3;
""", engine)
display(df4)